 #Напишите программу, которая составит список простых множителей числа N.



a=int(input('введите число'))
#c=prime_factor=1

for i in range(1,a+1):
    if a%i==0:
        print(i)



    
